import * as S from '../../styles/grammer'

const Adjective = () => {
    return(
        <S.Body>
            <h1>형용사</h1>
            <S.Title>형태적 분류</S.Title>
            <S.SubTitle>い형용사</S.SubTitle>
            <S.P>
            일본어에서 어미가 い인 형용사를 말한다. 青い(파랗다), 寒い(춥다), 恐ろしい(무섭다) 등이 그 예이다.<br/>
            대부분 일본어 고유어휘이다. 大和言葉(やまとことば)라고도 한다.
            </S.P>
            <S.SubTitle>な형용사(형용동사)</S.SubTitle>
            <S.P>
            단어의 끝이 だ로 끝나지만, 명사를 수식할 때는 な로 형태가 바뀌어서 명사를 수식하기 때문에 な형용사라고 부른다.<br/>
            활용은 명사 + だ와 유사하지만, 기본적으로 용언이기 때문에 활용이 조금 다른 점이 있다.<br/>
            한자어 및 외래어 유래 어휘가 많으며, 새로운 어휘가 지금도 만들어지고 있다.<br/>
            일본어 학교문법 (하시모토 문법)에서는 い형용사와는 다른 독립적인 품사인 형용동사 (形容動詞)로 분류한다.<br/> 
            문어에서 기존의 형용사로 표현할 수 없는 의미를 표현하기 위해, 명사 + に + あり (문어의 ナリ형용동사), 명사 + と + あり (문어의 タリ형용동사)로 사용한 것에서 기원한다. 자립어로서 용언의 일종이나, 의미는 형용사와 비슷하다. 그러나 형용사와는 다르게 명령형을 만들 수 있다는 점, 어간이 자립할 수 있다는 점에서는 동사와 유사한 특징을 지닌다.<br/>
            </S.P>
            <S.Title>의미적 분류</S.Title>
            <S.SubTitle>속성형용사</S.SubTitle>
            <S.SubTitle>감정・감각형용사</S.SubTitle>
            <S.Title> 형용사의 활용</S.Title>
            <S.Title>형용사의 특징</S.Title>
        </S.Body>
    )
}

export default Adjective