import * as S from '../../styles/grammer'

const adverb = () => {
    return(
        <S.Body>
            <S.Title>양태부사</S.Title>
            <S.P>
            양태부사(様態副詞)는 이름에서 알 수 있듯이 동작, 상태를 수식하는 말이다 (모양의 양, 형태의 태)<br/>
            의성어 및 의태어도 양태부사의 일종이다.<br/>
            의성어의 경우 탁음은 크고 굵은 소리를 나타내며, 청음은 맑고 경쾌한 소리를 나타낸다.<br/>
            의태어의 경우 탁음은 무거운 움직임, 부정적인 의미이며, 청음은 가볍고 경쾌한 움직임, 긍정적인 의미이다.<br/>
            </S.P>
            <S.Title>정도부사</S.Title>
            <S.P>
            동작 및 상태의 정도를 나타내는 말이다.<br/>
            양태부사와의 차이점은, 양태부사는 동작이나 상태가 벌어지는 모습을 나타낸다면, 정도부사는 그 정도를 나타내는 말이다.
            </S.P>
            <S.Title>시간부사</S.Title>
            <S.P>
            용언이 나타내는 사태를 시간적으로 한정하는 말이다.
            </S.P>
            <S.Title>진술부사</S.Title>
            <S.P>
            화자의 심리를 나타내는 말로, 추정, 비유, 부정, 의문, 희망 등을 나타내는 특정 술어와 호응 관계를 갖고 사용한다.
            </S.P>
            <S.Title>평가부사</S.Title>
            <S.P>
            용언을 한정하는 다른 부사들과 달리 문 전체를 수식하는 말이다.
            </S.P>
            <S.Title>부사의 체언 수식</S.Title>
            <S.P>
            부사는 연용수식어로서 체언을 수식할 수 없지만, 특정 형태(の、した 등)와 결합하여 체언을 수식하기도 한다.
            </S.P>
        </S.Body>
    )
}

export default adverb