import * as S from '../../styles/grammer'

const Postposition = () => {
    return(
        <S.Body>
            <h1>조사</h1>
            <S.Title>격조사</S.Title>
            <p>格助詞. 체언에 붙어 문법적 격, 즉 문장에서의 역할을 나타내는 조사. が, の, を, に, へ, と, で, から, より 등이 있다.</p>
            <b>{"が: '…이/가'"}</b>
            <ul>
                <li>{"동작이나 상태의 주체를 나타낸다. ― 한국어의 '…이/가'와 비슷한 뜻으로 쓰인다."}</li>
                <li>{`요구나 소망의 대상을 나타낸다. 동사의 ${"…iたい"} 활용과 세트로 딸리는 조사. 뜻은 1번과 같다.`}</li>
                <li>{"문어에서, 속격 표지나 접속사 역할을 하기도 한다. 말하자면 문어체에서의 の."}</li>
                <li>{"같은 단어 사이에 넣어 단어를 강조한다."}</li>
            </ul>

            <b>{"の: '…의'"}</b>
            <ul>
            <li>{"속격을 표시. 소유, 부분, 출처, 합성 등의 뜻을 나타낸다. - '…의'와 비슷한 뜻으로 쓰인다."}</li>
            <li>{"사물의 위치 등을 가리킨다. ― '…에 있는' 으로 사용된다. 뜻 그대로인 '…にある…'도 쓰인다."}</li>
            <li>{"…인의 뜻으로도 쓴다."}</li>
            <li>{"연용수식어의 동작, 상태의 주체를 나타낸다."}</li>
            <li>{"동사나 형용사를 체언으로 바꾼다. 이 용법은 조사라기보다 우리말의 의존 명사 '것'과 같다. - 수식어 앞에 동사가 붙어 있어 하나의 단어 덩어리 이야기가 되었다면, が를 쓸 자리에 の를 써도 된다."}</li>
            </ul>

            <b>{"を: '…을/를', '...에서'"}</b>
            <ul>
                <li>{"행위의 직접적 대상을 뜻한다. ― '…을/를'로 쓰인다."}</li>
                <li>{"출발점으로서의 장소를 뜻한다"}</li>
            </ul>

            <b>{"に: '…에'"}</b>
            <ul>
                <li>{"장소나 물건, 방향에 붙어 사물, 목적지의 위치를 알려준다."}</li>
            </ul>

            <b>{"へ: '…으로', '…에게'"}</b>
            <ul>
            <li>{"조사로 쓰이는 へ는 [he]가 아니라 [e]로 발음하니 주의."}</li>
            <li>{"이동, 향함의 목표를 나타낸다. に의 일부 용법과 유사하다. ― に는 '…에'와 비슷하다면 へ는 '…으로'와 비슷하다. 조금 어감이 다르다."}</li>
            <li>{"に는 출발점을 강조하는 느낌이 있다면, へ는 도착점을 강조하는 느낌이 있다."}</li>
            <li>{"'…에게/께'의 뜻으로도 쓰인다. ― 일본어에도 존댓말이 존재하지만, '…에게/께'(へ), '…가/께서'(が)의 구분은 없다."}</li>
            </ul>

            <b>{"と: '…와/과'"}</b>
            <ul>
            <li>{"병립, 나열의 역할을 한다. ― '…와', '…하고'의 뜻으로 쓰인다. 쭉 늘어놓은 단어들 사이에 넣는 조사."}</li>
            <li>{"인용을 표시한다."}</li>
            <li>{"인과관계를 표시한다."}</li>
            </ul>

            <b>{"で: '…에서'"}</b>
            <ul>
            <li>{"행위가 일어난 장소를 나타낸다. '…에서'와 같다."}</li>
            <li>{"행위의 수단, 유래, 이유 등을 나타낸다."}</li>
            <li>{"연속적인 사건끼리의 접속사 역할."}</li>
            </ul>

            <b>{"から: '…부터', '…로'"}</b>
            <ul>
            <li>{"시작점, 기원, 출처 등을 나타낸다. ― 한국어의 '…부터', '…로부터'"}</li>
            <li>{"재료로서의 '…로', '…로써'의 뜻으로도 쓰인다. ― で와 혼동할 수 있으니 주의. 원재료로 만들었지만 그 원재료가 완전히 없어졌을 때 쓰이는 조사."}</li>
            </ul>

            <b>{"より: '…보다'"}</b>
            <ul>
            <li>{"비교의 기준을 나타낸다. '…보다'와 같다."}</li>
            <li>{"문어에서, から의 역할을 하기도 한다. ― 편지를 쓸 때 등."}</li>
            </ul>
            <S.Title>병립조사</S.Title>
            <p>並立助詞, 하시모토 문법을 계승한 일본의 학교 문법에서는 따로 병립조사로 구분하지 않고 병립의 격조사라고 하여 격조사의 하위개념으로 취급한다.</p>
            <b>{"（と）か: '…거나'"}</b>
            <ul>
                <li>{"선택적인 것 등을 나열할 때 쓴다. '…거나'와 같은 뜻이다."}</li>
            </ul>
                 
            <b>{"や: '…와/과', '…(이)나'"}</b>
            <ul>
                <li>{"명사를 나열할 때 쓴다. '…와/과', '…(이)나'와 같은 뜻이다."}</li>
            </ul>
            <S.Title>특립조사</S.Title>
            <b>{"ばかり: '…정도' 사전"}</b>

            <b>{"まで: '…까지'"}</b>
            <S.P>{"도착점을 나타낸다. 한국어의 '…까지'와 비슷하다. 격조사로 분류할 수도 있다. 문어에서 간혹 한자로 迄라고 쓰기도 한다."}</S.P>

            <b>{"だけ: '…뿐'"}</b>
            <S.P>{"정도, 범위나 그 한계를 나타낸다. '…뿐'과 같다."}</S.P>

            <b>{"ほど(程): '…만큼', '…할 정도로'"}</b>
            <S.P>{"사물의 단계, 정도, 범위를 나타낸다. 한국어의 '…만큼', 혹은 '…할 정도로'와 유사하다. 히라가나로 쓰기도 하지만 한자 程으로 쓸 때도 많다."}</S.P>

            <b>{"くらい: '…정도', '…만큼' 사전"}</b>

            <b>{"など: '…따위'"}</b>
            <S.P>{"명사나 연체형에 붙는다. 많은 것 중 대표적인 것을 뽑아 예시로 든다는 것을 나타낸다. 한국어의 '…따위'와 유사."}</S.P>

            <b>{"なり: '…든(지)' 사전"}</b>

            <b>{"やら: '…인가' 사전"}</b>

            <b>{"すら: '…마저', '…조차'"}</b>
            <S.P>{"'…마저', '…조차'의 뜻이다. さえ와 같다. 단, さえ와 달리 すら는 조건절에 쓸 수 없다."}</S.P>

            <b>{"や: '…나'"}</b>
            <S.P>{"병렬, 열거하는 데에 쓴다. と는 '…와'의 뜻으로, 문장에 열거된 것들만 언급하는 반면, や는 문장에 제시된 것들 말고 다른 것도 있다는 느낌을 준다."}</S.P>

            <b>{"は: '…은/는'"}</b>
            <S.P>{"조사로 쓰이는 は는 [ha]가 아니라 [wa]로 발음함에 주의."}</S.P>
            <S.P>{"주제를 표시한다."}</S.P>
            <S.P>{"한 가지 염두에 두어야 할 것이 있다. 대화에서 화제를 전환할 때는 は를 쓰는 편이 좋다. 한국어에서는 '취미가 있습니까?'라고 해도 문제는 없지만 일본어에서는 は를 써야 자연스럽다."}</S.P>

            <b>{"って: '…은/는' '...라고' 등등"}</b>
            <S.P>{"어떠한 말에 대한 의문을 표현할 때 사용된다."}</S.P>
            <S.P>{"주의: って가 '은/는'으로 해석되기도 하지만 は와 문법적으로 아주 같은 것이 아니다. 다음 예를 보자."}</S.P>

            <S.P>{"名前は何ですか？ / 名前って何ですか？"}</S.P>

            <S.P>{"둘 다 '이름이 무엇인가요'로 번역이야 할 수 있지만 진짜 의미는 다르다. 전자는 상대방의 이름을 알고 싶다는 뜻이며, 후자는 '이름'이라는 것이 무슨 뜻이냐고 물어보는 것이다. 그러므로 '穿鑿'라는 단어를 보고 이게 뭔 뜻이냐고 물어보고 싶을 때는 '穿鑿は何ですか？'가 아니라 '穿鑿って何ですか？'로 표현해야 한다. 참고로 穿鑿는 穿(뚫을 천)과 鑿(뚫을 착)을 쓴, '천착'이라는 뜻의 한자어로 발음은 せんさく이다."}</S.P>
            <S.P>{"2. 조사뿐만이 아니라 이 외의 많은 압축어와 어미에서 사용된다."}</S.P>
            <b>{"も: '…도'"}</b>
            <S.P>{"앞에 제시된 것과 유사한 개념을 첨가(제시), 병렬, 나열할 때 쓰인다."}</S.P>

            <b>{"こそ: '…야말로'"}</b>
            <S.P>{"다른 것과 다르게 특별하다는 강조의 의미를 나타낸다. 한국어의 '…야말로'와 비슷하다."}</S.P>
            <S.Title>종조사</S.Title>
            <p>終助詞. 문장 끝에 쓰여서 화자의 청자에 대한 태도를 나타내는 조사이다. 남성이 주로 쓰는 말과 여성이 주로 쓰는 말, 남녀 구분 없이 쓰이는 말 등 나뉜다.<br/>
            주로 「わ、の、かしら」 등은 여성, 「ぞ、ぜ」 등은 남성이 사용하고 「か、ね、よ、な」 등은 성별 구분 없이 사용한다.</p>

            <b>か</b>
            <ul>
            <li>질문, 수사의문을 나타낸다.</li>
            </ul>

            <b>かい</b>
            <ul>
            <li>친밀감을 갖고 묻거나 확인하는 기분을 나타내는 말; …냐; …니.</li>
            <li>강한 반대나 부정(否定)의 뜻을 나타내는 말.</li>
            </ul>

            <b>な</b>
            <ul>
            <li>종지형에 붙어 금지 명령을 나타낸다.</li>
            <li>구어에서, 연용형에 붙어 권유, 명령을 나타낸다. なさい가 줄어든 형태.</li>             
            </ul>

            <b>さ</b>
            <ul>
            <li>{"가벼운 강조, 단정, 전달의 느낌을 나타낸다. 한국어의 '…말이야'와 비슷한 어감이다. 말 중간에 붙기도 한다."}</li>
            </ul>

            <b>ぜ</b>
            <ul>
            <li>구어에서 단정, 다짐, 강조의 의미를 지닌다. ぞ와 뜻이 같으나 ぞ보다 거친 말투이며 현대에서는 사용 빈도가 급락하고 있다.</li>
            </ul>

            <b>ぞ</b>
            <ul>
            <li>{"자신의 의견이나 의지를 강하게 내세운다. 한국어의 '…(다)고'와 어느 정도 유사."}</li>
            </ul>

            <b>な</b>
            <ul>
            <li>{`감탄 등을 나타낸다. 한국어의 "~네", "~군", "~지" 등과 비슷하다.`}</li>
            </ul>

            <b>ね</b>
            <ul>
            <li>{`자신의 의견을 조심스레 제시하고 상대의 동의를 구하는 말투를 나타낸다. 한국어의 "~지"와 어느 정도 비슷하다.`}</li>
            </ul>

            <b>の</b>
            <ul>
            <li>(끝을 올리면) 아이나 친한 사이에게 쓰며, 질문을 나타낸다.</li>
            <li>(끝을 내리면) 아이나 여성이 가볍게 단정지을 때 사용한다.</li>
            </ul>

            <b>や</b>
            <ul>
            <li>감탄, 재촉을 나타낸다.</li>
            <li>문어에서, 강조의 뜻을 나타낸다.</li>
            </ul>

            <b>よ</b>
            <ul>
            <li>강조를 나타낸다.</li>
            <li>혹은, 무언가를 가르쳐주고 싶어하는 느낌도 준다.</li>
            </ul>

            <b>わ</b>
            <ul>
            <li>가벼운 감탄을 나타낸다.</li>
            <li>여성적 표현으로 단정짓는 것을 꺼릴 때 사용한다.</li>
            </ul>

        </S.Body>
    )
}

export default Postposition