import * as S from '../../styles/grammer'

const Pronoun = () => {
    return(
        <S.Body>
        <h1>대명사</h1>
        <S.Title>1인칭 대명사</S.Title>
        <p>아타이(あたい) - 여성용</p> 
        <p>아타시(あたし) - 여성용</p> 
        <p>우치(内) - 여성이나 어린아이가 쓰는 말로서, 주로 중학생 대의 청소년이 주로 쓴다.</p> 
        <p>오이라(己等) - 오레의 복수형인 오레라(俺ら)의 변형. 올드한 어투의 거친 느낌을 주는 1인칭.</p> 
        <p>오레(俺) - 주로 청소년 이후의 남성이 사용한다.</p> 
        <p>오레사마(俺様) - 남성형 1인칭인 {`'오레'에, 높여 부르는 '사마'`}가 붙은 남성형 1인칭 대명사</p> 
        <p>지분(自分) - 주로 일본의 남성 운동선수들이 많이 쓰는 일본어의 1인칭 대명사</p> 
        <p>친(朕) - 황제 전용 일인칭 대명사 {'짐'}의 일본형</p> 
        <p>보쿠(僕) - 젊은 남성이 자기 자신을 가리키는 단어</p> 
        <p>마로(麻呂) - 일본 귀족인 쿠교들의 1인칭</p> 
        <p>요(余) - 주로 왕이나 황제, 혹은 고위층에 있는 캐릭터들이 사용하는 인칭대명사.</p> 
        <p>와이(私)</p> 
        <p>와가하이(我輩輩) - 주로 남성이 사용하며 거만을 떠는 어감의 1인칭.</p> 
        <p>와시(儂) - 주로 노인이나 높으신 분, 특히 남자쪽에서 자주 사용하는 어투</p> 
        <p>와타쿠시(私)</p> 
        <p>와타쿠시메(私奴め)</p> 
        <p>와타시(私) - 일본에서 가장 기본/보편적인 1인칭 대명사이다.</p> 
        <p>와라와(妾) - 주로 고풍스러운 공주나 여왕들이 사용하는 어투</p> 
        <p>와레(我) - 현대 일본어의 구어에서는 거의 쓰이지 않는, 굉장히 문어체적인 단어.</p> 
        <S.Title>2인칭 대명사</S.Title>
        <p>아나타(あなた)</p>
        <p>안타(あんた)</p>
        <p>오타쿠(おたく·お宅)</p>
        <p>오누시(御主)</p>
        <p>오마에(お前)</p>
        <p>키사마(貴様)</p>
        <p>키미(君)</p>
        <p>소나타(其方)</p>
        <p>테메에(てめえ)</p>
        <p>난지(爾·汝·女)</p>
        <p>와이(私)</p>
        <S.Title>3인칭 대명사</S.Title>
        <p>카노죠(彼女)</p>
        <p>카레(彼)</p>
        </S.Body>
    )
}

export default Pronoun