const Explanation = () => {
    return(
        <>
        이 사이트는 일본어를 배우기 쉽도록 도와주는 사이트 입니다.<br/>
        일본어 공부의 장점<br/>
        일본어는 세계에서 한국인들이 배우기에 가장 쉬운 외국어라는 말이 있을정도로 한국어와 비슷한 어법체계를 가지고 있다.<br/>
        일본의 문자<br/>
        일본어는 히라가나, 가타카나, 한자 총 3개의 문자를 사용합니다.<br/>
        각각의 문자는 주로 <br/>
        예를 들어 明(밝을 명)의 오음은 ミョウ(myō), 한음은 メイ(mei), 당음은 ミン(min)이다.<br/>
        훈독은 한자를 읽는 법이라기보다는, 의미 구분을 쉽게 하기 위해서 한자어가 아닌 순 일본어를 같은 의미의 한자로 빌려 적고 읽는 것이다.<br/>
        다시 말하면 훈차가 보편화된 것이다.<br/>
        예를 들면 や(ya, 집)라는 단어는 屋(집 옥)과 家(집 가)에 둘 다 쓰이고, 後(뒤 후)는 あと(ato, 뒤, 나중), のち(nochi, 훗날), うしろ(ushiro, 뒤쪽)에 대응될 수 있다.<br/>
        그 외에 두 글자 이상의 한자어에 대해 한 고유어를 대응하는 방법인 숙자훈(熟字訓)도 있으며, 인명이나 지명 같은 경우 상용 독법 범위 밖에서 새로운 독법을 쓰기도 한다.<br/>
        한국에서 전통적인 형태의 한자를 그대로 쓰는 것과는 다르게 일본에서는 1949년에 간략화된 형태의 한자인 신자체를 쓴다.<br/>
        일본의 사용한자는 2136자이다.<br/>
        JLPT<br/>
        일본 외무성 산하 독립 행정법인[5] 국제교류기금(国際交流基金)[6]과 공익재단법인 일본국제교육지원협회(公益財団法人 日本国際教育支援協会)[7]에서 주최하는 공인 일본어 능력 시험. 일본어를 모어로 하지 않는 사람을 대상으로 한다.[8] 일본을 비롯하여 전 세계 60여 개 국가에서 응시 가능하다.<br/>
        JLPT에서 취득한 능력은 국제교류기금이 보증하고 일본의 정부기관인 일본 외무성이 후견인이고 국제상으로 인정되며, 한 번 취득한 급수는 평생 유효하다. 단, 한국에서는 여타 어학시험들과 같이 기업이나 학교 등의 기관에서 2년 이내의 최근의 성적을 경우에 따라 요구할수도 있다.[9]<br/>
        JLPT N1, N2, N3, N4, N5중에서 N1급이 최고급수이며, N1을 180점 만점에 100점 이상으로 합격한 자는 고등학교 학력 이상의 일본어 원어민(Native Speaker)에 준하는 실력을 보유하고 있다고 사료된다.<br/>
        JLPT의 연간 응시자 수는 2019년 기준 세계적으로 136만명을 돌파하였다.<br/>
        매년 7월과 12월 첫째 주 일요일에 시행한다. 단 7월 시험은 한국, 일본 등을 포함한 20여개 정도의 나라에서만 시행하며 12월에는 JLPT를 시행하는 거의 모든 국가에서 시행한다.<br/>
        JPT<br/>
        YBM에서 주최, 실시하는 일본어 능력시험. Japanese Proficiency Test. 현재 한국에서는 JLPT와 더불어 일본어 양대 시험으로 불리고 있다.<br/>
        사설 학원 시험으로, 세계적 공신력은 적으나, 국내 취업의 경우 대다수의 기업이 일본어 실력을 인정해 주는 편. 그러나 일본어학과의 교수들은 JLPT를 밀어주며 그때문에 시중에 나와있는 교재의 종류도 JLPT가 더 많다. JLPT는 일본 정부가 직접 주관하는 시험인 데 반해, JPT는 사설 시험이므로 일본어 능력에 초점을 둔 시험이다, 한국인에 있어서 JLPT는 쉽고, JPT가 어렵다는 인식이 유난히 많아[1], 당연하게도 대한민국의 기업들은 JLPT보다는 난이도 면에서 변별력이 좋은 JPT를 더 인정해 주는 분위기다. 물론 한국인을 채용한 적이 있는 일본 기업이나, 한국인이 운영하는 일본 기업은 JPT도 인정해 주는 편이니, 어째건 취업을 할 생각이라면 필요하고 이득이 있는 시험이다.<br/>
        문법
        명사
        명사는 조사가 뒤에 붙어서 주어, 혹은 보어가 되며, 조동사 「だ、です」가 붙어 명사문을 만든다.
        명사는 보통명사, 고유명사, 대명사, 수량명사가 있다.
        또한 「ところ、わけ」 와 같이 원래의 의미를 잃어버린 채 관용적으로 쓰이는 형식명사와 두 성분이 결합되어 만들어지는 합성명사가 있다.
        외래어는 가타카나로, 외래어가 아닌 단어는 한자나 히라가나로 쓴다.
        형식명사
        명사 중, 본래 갖고 있던 의미가 퇴색되고 문장 속에서 관용적으로 쓰이는 종류의 명사를 말한다. 「もの・わけ・こと・ところ」 등이 있다.
        형식명사는 원래 의미와는 멀어져 관용적으로 쓰이므로 한자로 표기하지 않는다.
        합성명사
        합성명사는 복합명사와 파생명사로 구분된다. 복합명사는 두 개의 단어가 합쳐져 만들어진 것이고, 파생명사는 한 개의 단어와 한 개의 부속성분이 합쳐져서 만들어지는 것을 말한다. 쉽게 말해서 한국어 문법의 합성어, 파생어와 유사하다고 생각하면 될 것이다.
        보통명사는 구체적인 어떠한 대상을 가리키는 구체명사, 추상적인 개념을 나타내는 추상명사로 나뉜다.
        <tbody>
            <tr>
                <td>
                    <div>구분</div>
                </td>
                <td>
                    <div>단어 1</div>
                </td>
                <td>
                    <div>뜻</div>
                </td>
                <td>
                    <div>단어 2</div>
                </td><td>
                <div>뜻</div>
                </td>
                <td>
                <div>합쳐진 단어</div>
                </td>
                <td>
                    <div>뜻</div>
                </td>
                </tr>
                <tr>
                <td rowSpan={2}>
                    <div>복합명사</div>
                </td>
                <td>
                    <div>夏</div>
                </td>
                <td>
                    <div>여름</div>
                </td>
                <td>
                    <div>休み</div>
                </td>
                <td>
                    <div>휴식</div>
                </td>
                <td>
                    <div>夏休み</div>
                </td>
                <td>
                    <div>여름 방학</div>
                </td>
                </tr>
                <tr>
                    <td>
                        <div>花</div>
                    </td>
                    <td>
                        <div>
                        꽃</div>
                    </td>
                    <td>
                        <div>
                        祭り</div>
                    </td>
                    <td>
                        <div>
                        축제</div>
                    </td>
                    <td>
                        <div>
                        花祭り</div>
                    </td>
                    <td>
                        <div>
                        꽃 축제</div>
                    </td>
                    </tr>
                    <tr>
                        <td rowSpan={2}>
                        <div>
                        파생명사</div>
                    </td>
                    <td>
                        <div>
                        小</div>
                    </td>
                    <td>
                        <div>
                        작음</div>
                    </td>
                    <td>
                        <div>
                        鳥</div>
                    </td>
                    <td>
                        <div>
                        새</div>
                    </td>
                    <td>
                        <div>
                        小鳥</div>
                    </td>
                    <td>
                        <div>
                        작은 새</div>
                    </td>
                    </tr>
                    <tr>
                    <td>
                        <div>
                        寿司
                        </div>
                    </td>
                    <td>
                        <div>
                        초밥</div>
                    </td>
                    <td>
                        <div>
                        屋</div>
                    </td>
                    <td>
                        <div>
                        ~가게</div>
                    </td>
                    <td>
                        <div>
                        寿司屋</div>
                    </td>
                    <td>
                        <div>
                        초밥집</div>
                    </td>
                    </tr>
                    </tbody>    
        위에서 알 수 있듯이, 복합명사는 각각이 단독으로 쓰이는 단어이며 합쳐졌을 때 각각의 뜻을 가지고 있다.
        하지만 파생명사의 경우 부속성분은 단독으로 쓰이지 않으며 합쳐졌을 때 원래 명사의 의미를 제한한다.
        한국어에 접두사, 접미사가 있듯 일본어도 앞에 주로 붙는 성분과 뒤에 주로 붙는 성분이 존재한다.
        진성명사
        다른 품사로부터 만들어지는 명사를 전성명사라고 한다. 동사나 형용사에서 파생된 것이 많다.

        帰る ⇒ 帰り / 考える ⇒ 考え / 白い ⇒ 白 / 黒い ⇒ 黒 / 熱い ⇒ 熱さ
        대명사
        1인칭 대명사
        아타이(あたい) 
        아타시(あたし) 
        우치(内) 
        오이라(己等) 
        오레(俺) 
        오레사마(俺様) 
        지분(自分) 
        친(朕) 
        보쿠(僕) 
        마로(麻呂) 
        요(余) 
        와이(私) 
        와가하이(我輩輩) 
        와시(儂) 
        와타쿠시(私) 
        와타쿠시메(私奴め) 
        와타시(私) 
        와라와(妾) 
        와레(我)
        2인칭 대명사
        아나타(あなた) · 안타(あんた) · 오타쿠(おたく·お宅) · 오누시(御主) · 오마에(お前) · 키사마(貴様) · 키미(君) · 소나타(其方) · 테메에(てめえ) · 난지(爾·汝·女) · 와이(私)
        3인칭 대명사
        카노죠(彼女) · 카레(彼)
        사이트 소개<br/>
        </>
    )
}

export default Explanation