import * as S from '../../styles/grammer'

const Pronoun = () => {
    return(
        <S.Body>
        <h1>대명사</h1>
        <S.Title>1인칭 대명사</S.Title>
        <S.P>
        아타이(あたい) - 여성용 1인칭 대명사<br/> 
        아타시(あたし) - 여성용 1인칭 대명사<br/> 
        우치(内) - 여성이나 어린아이가 쓰는 말로서, 주로 중학생 대의 청소년이 주로 쓴다.<br/> 
        오이라(己等) - 오레의 복수형인 오레라(俺ら)의 변형. 올드한 어투의 거친 느낌을 주는 1인칭<br/> 
        오레(俺) - 주로 청소년 이후의 남성이 사용한다.<br/> 
        오레사마(俺様) - 남성형 1인칭인 {`'오레'에, 높여 부르는 '사마'`}가 붙은 남성형 1인칭 대명사<br/> 
        지분(自分) - 주로 일본의 남성 운동선수들이 많이 쓰는 일본어의 1인칭 대명사<br/> 
        친(朕) - 황제 전용 일인칭 대명사 {'짐'}의 일본형<br/> 
        보쿠(僕) - 젊은 남성이 자기 자신을 가리키는 단어<br/> 
        마로(麻呂) - 일본 귀족인 쿠교들의 1인칭<br/> 
        요(余) - 주로 왕이나 황제, 혹은 고위층이 사용하는 인칭대명사.<br/> 
        와이(私) - 와시(わし)에서 변형된 것으로 주로 여성이 사용한다<br/> 
        와가하이(我輩輩) - 주로 남성이 사용하며 거만을 떠는 어감의 1인칭.<br/> 
        와시(儂) - 주로 노인이나 높으신 분, 특히 남자쪽에서 자주 사용하는 어투<br/> 
        와타쿠시(私) - 일본에서 가장 기본/보편적인 1인칭 대명사<br/> 
        와타쿠시메(私奴め) - 와타쿠시(私)에 자신을 낮추는 비칭 접미사 메(奴 / め)를 덧붙여 지극히 정중하게 자신을 낮추는 표현<br/> 
        와타시(私) - 일본에서 가장 기본/보편적인 1인칭 대명사<br/> 
        와라와(妾) - 주로 고풍스러운 공주나 여왕들이 사용하는 어투<br/> 
        와레(我) - 현대 일본어의 구어에서는 거의 쓰이지 않는, 굉장히 문어체적인 단어
        </S.P>
        <S.Title>2인칭 대명사</S.Title>
        <S.P>
        아나타(あなた) -  {`'당신/그대', '너', '여보(부부 사이 한정), 자네`}<br/>
        안타(あんた) - 아나타(あなた)가 줄어든 것으로 가까운 사이나 손아랫사람에게 쓰는 대명사<br/>
        오타쿠(おたく·お宅) - 상대방, 상대방의 남편, 또는 상대방이 속한 집단(가정, 회사 등)의 높임 표현<br/>
        오누시(御主)- 옛스런 인물이 상대를 정중히 부를때 자주 쓰는 표현<br/>
        오마에(お前) - {`'야', '너'`}<br/>
        키사마(貴様) - 네 놈, 네 이놈<br/>
        키미(君) - 너 혹은 자네<br/>
        소나타(其方) - 그대<br/>
        테메에(てめえ) - 당신, 이 자식, 네놈<br/>
        난지(爾·汝·女) - 문어적이고 중립적인 느낌의 단어<br/>
        와이(私) - 와타시(私)의 변형 간사이 방언에서는 {`'나'(1인칭), 규슈 지방에서는 '너'(2인칭)`}
        </S.P>
        <S.Title>3인칭 대명사</S.Title>
        <S.P>
        카노죠(彼女) - 여성을 뜻하는 대명사.<br/>
        카레(彼) - 남성을 뜻하는 대명사.
        </S.P>
        </S.Body>
    )
}

export default Pronoun